app/controllers/admin/brands_controller.rb

INSERT INTO "brands" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-06-23 04:01:20.192687"], ["name", "臺灣"], ["updated_at", "2015-06-23 04:01:20.192687"]]
---
  def create
    @brand = Brand.new(brand_params)
    if @brand.save

SELECT  "brands".* FROM "brands"  WHERE "brands"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 1]]
---
  def destroy
    @brand = Brand.find(params[:id])
    @brand.destroy

SELECT "brands".* FROM "brands"   ORDER BY "brands"."name" ASC
SELECT "categories".* FROM "categories"
---
  def index
    @page_title = 'Manage Brands'
    @brands = Brand.all.order(:name)
    @categories = Category.all