app/controllers/admin/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-06-23 03:58:44.030878"], ["name", "人造草皮"], ["updated_at", "2015-06-23 03:58:44.030878"]]

  def edit
    @page_title = 'Edit Category'
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]

  def index
    if params[:search]
      @page_title = "Search for: " + params[:search]
      @categories = Category.search(params[:search]).all.order(:name).paginate(:per_page => 10, :page => params[:page])
---
SELECT  "categories".* FROM "categories"   ORDER BY "categories"."name" ASC LIMIT 10 OFFSET 0

  def newsub
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]

  def createsub
    @category = Category.find(params[:id])
    @subcategory = Subcategory.new(subcategory_params)
    if @subcategory.save
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "subcategories" ("category_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 2], ["created_at", "2015-06-26 07:06:59.703117"], ["name", "豪華松針聖誕樹"], ["updated_at", "2015-06-26 07:06:59.703117"]]

  def indexsub
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]

  def showsub
    @subcategory = Subcategory.find(params[:sub_id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "subcategories".* FROM "subcategories"  WHERE "subcategories"."id" = ? LIMIT 1  [["id", 1]]