app/controllers/admin/informations_controller.rb

SELECT  "information".* FROM "information"   ORDER BY "information"."id" ASC LIMIT 1
---
  def index
  	@page_title = "Informations"
 		@informations = Information.all

UPDATE "information" SET "JumbotronImg" = ?, "JumbotronSubtitle" = ?, "JumbotronTitle" = ?, "updated_at" = ? WHERE "information"."id" = 1  [["JumbotronImg", ""], ["JumbotronSubtitle", "<p>研發&amp;製造</p>"], ["JumbotronTitle", "<p><span style=\"font-size: 50px;\">義臺人造有限公司</span></p>"], ["updated_at", "2015-06-26 08:56:32.131424"]]
---
  def update
  	if @information.update(info_params)