app/controllers/admin/products_controller.rb

INSERT INTO "products" ("brand_id", "category_id", "created_at", "description", "diameter", "image", "item_number", "model_name", "part_number", "size", "subcategory_id", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.create(product_params)

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @page_title = "Edit product"
    @product = Product.find(params[:id])

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["description", "<p><strong>戶外專用</strong></p><p><b>露營必買</b></p><p><b>詳情請詢價</b></p>"], ["updated_at", "2015-06-25 08:20:44.824816"]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)

SELECT  "products".* FROM "products"   ORDER BY created_at DESC LIMIT 8 OFFSET 0
---
  def index
    params[:sort] ||= "created_at DESC"  #default sort by created date
    if params[:search]
      @products = Product.search(params[:search]).all.order(params[:sort]).paginate(:per_page => 8, :page => params[:page])