app/controllers/admin/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_hash", "password_salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"   ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
    if params[:search]
      @users = User.search(params[:search]).all.order('created_at DESC').paginate(:per_page => 10, :page => params[:page])