app/views/admin/brands/index.html.erb

	  <td><%= brand.name %></td>
	  <td><%= link_to brand.products.count, admin_brand_path(brand), class:'product-quantity' %></td>
---
SELECT COUNT(*) FROM "products"  WHERE "products"."brand_id" = ?  [["brand_id", 1]]