app/views/partials/_footer.html.erb

				<li class="footer-title">Products</li>
				<% @categories = Category.all %>
---
SELECT "categories".* FROM "categories"

				<li class="footer-title">Brands</li>
			<% @brands = Brand.all %>
---
SELECT "brands".* FROM "brands"

			<ul>
				<% @information = Information.first %>
---
SELECT  "information".* FROM "information"   ORDER BY "information"."id" ASC LIMIT 1