app/views/partials/_homeTopbar.html.erb

          <li class="first-category"><%= link_to category.name, category_path(category) %>
            <span class="<%= 'caret' if category.subcategories.exists? %>" style="color:black;"></span>
---
SELECT  1 AS one FROM "subcategories"  WHERE "subcategories"."category_id" = ? LIMIT 1  [["category_id", 1]]
SELECT "categories".* FROM "categories"
SELECT "subcategories".* FROM "subcategories"  WHERE "subcategories"."category_id" = ?  [["category_id", 1]]