app/views/partials/_navbar.html.erb

SELECT "categories".* FROM "categories"
---
            <ul class="dropdown-menu" role="menu">
              <% @categories = Category.all %>

SELECT "brands".* FROM "brands"
---
            <ul class="dropdown-menu" role="menu">
              <% @brands = Brand.all %>