app/views/partials/_sidebar.html.erb

      <li class="first-category"><%= link_to category.name, category_path(category) %>
        <span class="<%= 'caret' if category.subcategories.exists? %>" style="color:black;"></span>
---
SELECT  "subcategories".* FROM "subcategories"  WHERE "subcategories"."category_id" = ? AND "subcategories"."id" = 1 LIMIT 1  [["category_id", 2]]
SELECT  1 AS one FROM "subcategories"  WHERE "subcategories"."category_id" = ? LIMIT 1  [["category_id", 1]]
SELECT "categories".* FROM "categories"