app/views/admin/categories/indexsub.html.erb

	  <td><%= subcategory.name %></td>
	  <td><%= link_to subcategory.products.count, admin_subcategory_path(params[:id],subcategory.id), class:'product-quantity' %></td>
---
SELECT COUNT(*) FROM "products"  WHERE "products"."subcategory_id" = ?  [["subcategory_id", 1]]