app/views/admin/categories/index.html.erb

SELECT COUNT(*) FROM "products"  WHERE "products"."category_id" = ?  [["category_id", 1]]
---
	  <td><%= category.name %></td>
	  <td><%= link_to category.products.count, admin_category_path(category), class:'product-quantity' %></td>