app/views/admin/categories/newsub.html.erb

		<%= f.label :category, as:'Parent Category' %>
		<%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:selected => @category.id}, class:'form-control' %>
---
SELECT "categories".* FROM "categories"