app/controllers/brands_controller.rb

  def show
  	@categories = Category.all # for category sidebar
  	@brands = Brand.all # for brand sidebar

  	@brand = Brand.find(params[:id])
  	@products = @brand.products.paginate(:per_page => 9, :page => params[:page])
---
SELECT "categories".* FROM "categories"
SELECT "brands".* FROM "brands"
SELECT  "brands".* FROM "brands"  WHERE "brands"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products"  WHERE "products"."brand_id" = ? LIMIT 9 OFFSET 0  [["brand_id", 1]]
SELECT COUNT(*) FROM "products"  WHERE (brand_id = '1' AND category_id = 1)