app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT "brands".* FROM "brands"
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products"  WHERE "products"."category_id" = ? LIMIT 9 OFFSET 0  [["category_id", 1]]
SELECT COUNT(*) FROM "products"  WHERE (category_id = '1' AND brand_id = 1)
---
  def show
  	@categories = Category.all # for category sidebar
  	@brands = Brand.all # for brand sidebar

  	@category = Category.find(params[:id])
  	@products = @category.products.paginate(:per_page => 9, :page => params[:page])

SELECT "categories".* FROM "categories"
SELECT "brands".* FROM "brands"
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "subcategories".* FROM "subcategories"  WHERE "subcategories"."category_id" = ? AND "subcategories"."id" = 1 LIMIT 1  [["category_id", 2]]
SELECT  "products".* FROM "products"  WHERE "products"."subcategory_id" = ? LIMIT 9 OFFSET 0  [["subcategory_id", 1]]
---
  def showsub
    @categories = Category.all # for category sidebar
    @brands = Brand.all # for brand sidebar
    @category = Category.find(params[:id])
    @subcategory = @category.subcategories.find_by_id(params[:sub_id])
    @products = @subcategory.products.paginate(:per_page => 9, :page => params[:page])