app/controllers/contacts_controller.rb

  def new
    @contact = Contact.new
    @customer_info = Customer
    @information = Information.first
---
SELECT  "information".* FROM "information"   ORDER BY "information"."id" ASC LIMIT 1