app/controllers/products_controller.rb

  def index
  	@categories = Category.all
  	@brands = Brand.all
    if params[:search]
      @page_title = "Search for: " + params[:search]
      @products = Product.search(params[:search]).all.order('created_at DESC').paginate(:per_page => 9, :page => params[:page])
---
SELECT "categories".* FROM "categories"
SELECT "brands".* FROM "brands"
SELECT  "products".* FROM "products"  WHERE (lower(title) like '%七里香%' OR lower(model_name) like '%七里香%' OR lower(part_number) like '%七里香%' OR lower(item_number) like '%七里香%' OR lower(diameter) like '%七里香%' OR lower(size) like '%七里香%' OR lower(description) like '%七里香%' OR lower(tags) like '%七里香%')  ORDER BY created_at DESC LIMIT 9 OFFSET 0

  def show
    @categories = Category.all
    @brands = Brand.all
    @product = Product.includes(:category,:brand).find(params[:id])
---
SELECT "categories".* FROM "categories"
SELECT "brands".* FROM "brands"
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "brands".* FROM "brands"  WHERE "brands"."id" IN (1)
SELECT "categories".* FROM "categories"  WHERE "categories"."id" IN (1)