app/views/partials/admin/_productForm.html.erb

SELECT "categories".* FROM "categories"
---
		<%= f.label :category %>
		<%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'}, class:'form-control' %>

SELECT "subcategories".* FROM "subcategories"  WHERE "subcategories"."category_id" = ?  [["category_id", 1]]
---
	<div class="form-group">
		<%= f.input :subcategory_id, collection: Category.all, as: :grouped_select, group_method: :subcategories, prompt: "Select One" %>

SELECT "brands".* FROM "brands"
---
		<%= f.label :brand %>
		<%= f.select :brand_id, Brand.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'}, class:'form-control' %>